<a href="https://colab.research.google.com/github/ola-sumbo/Hamoye-and-ML-with-Ude/blob/master/Panda.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [32]:
# importing pandas as pd
import pandas as pd
import numpy as np
days = pd.Series(['Monday', 'Tuesday', 'Wednesday'])
print(days)

0       Monday
1      Tuesday
2    Wednesday
dtype: object

In [35]:
# creating series with a numpy array
days_list = np.array(['Monday', 'Tuesday', 'Wednesday'])
numpy_days = pd.Series(days_list)
print(numpy_days)

0       Monday
1      Tuesday
2    Wednesday
dtype: object

In [43]:
# using strings as index
days = pd.Series(['Monday', 'Tuesday', 'Wednesday'],index=['a', 'b', 'c'])
# create series from a dictionary
days1 = pd.Series({'a':'Monday', 'b':'Tuesday', 'c':'Wednesday'})

#Series can be accessed using the specified index as shown below
days[0]  # days data at index zero and column 0
days[1: ] 
days['c']

'Wednesday'

In [4]:
# create a dataframe from a dictionary
df_dict = {'Country': ['Ghana', 'Kenya', 'Nigeria', 'Togo'],
           'Capital': ['Accra', 'Nairobi', 'Abuja', 'Lome'],
           'Population': [10000, 8500, 35000, 12000],
           'Age': [60, 70, 80, 75]
}

df_dict

{'Age': [60, 70, 80, 75],
 'Capital': ['Accra', 'Nairobi', 'Abuja', 'Lome'],
 'Country': ['Ghana', 'Kenya', 'Nigeria', 'Togo'],
 'Population': [10000, 8500, 35000, 12000]}

In [11]:
df = pd.DataFrame(df_dict, index=[2, 4, 6, 8])
df

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8     Togo     Lome       12000   75

In [15]:
# Alternative way of creating using pandas and list instead of dictionaries

df_list = [['Ghana', 'Accra', 10000, 60], 
           ['Kenya', 'Nairobi', 8500, 70], 
           ['Nigeria',   'Abuja', 35000, 80], 
           ['Togo', 'Lome', 12000, 75]]
df1 = pd.DataFrame(df_list, columns=['Country', 'Capital','Population', 'Age'], 
                   index=[2, 4, 6, 8])
df1

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8     Togo     Lome       12000   75

In [16]:
# Accessing elements using loc and iloc for rows
df.iloc[3] # select df at index location 3

Country        Togo
Capital        Lome
Population    12000
Age              75
Name: 8, dtype: object

In [17]:
df.loc[6]  # select df at location 6

Country       Nigeria
Capital         Abuja
Population      35000
Age                80
Name: 6, dtype: object

In [18]:
# select the Capital column
df['Capital']

2      Accra
4    Nairobi
6      Abuja
8       Lome
Name: Capital, dtype: object

In [19]:
df.at[6, 'Country']

'Nigeria'

In [20]:
df.iat[2, 0] # iat mean at index position row 2 from 0 and column 0 position

'Nigeria'

In [26]:
# Dealing with missing values 
df_dict2 = {'Name': ['James', 'Yemen', 'Caro', np.nan],
           'Profession': ['Researcher', 'Artist', 'Doctor', 'Writer'],
           'Experience': [12, np.nan, 10, 8],
           'Height': [np.nan, 175, 180, 150]
            }

new_df = pd.DataFrame(df_dict2)

# check for cells with missing values as True
new_df.isnull()

    Name  Profession  Experience  Height
0  False       False       False    True
1  False       False        True   False
2  False       False       False   False
3   True       False       False   False

In [27]:
# remove rows with missing values
new_df.dropna()  # only rows with no na is kept in the df

   Name Profession  Experience  Height
2  Caro     Doctor        10.0   180.0

In [30]:
# Using the describe inbuilt function
df['Population'].sum() 
df.mean()
df.describe()

         Population        Age
count      4.000000   4.000000
mean   16375.000000  71.250000
std    12499.166639   8.539126
min     8500.000000  60.000000
25%     9625.000000  67.500000
50%    11000.000000  72.500000
75%    17750.000000  76.250000
max    35000.000000  80.000000